IDEA Open Model
SupportTypeInDirrection Enumeration
Compatible with IDEA StatiCa 20.1
 Type opf support in the direction
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum SupportTypeInDirrection
Public Enumeration SupportTypeInDirrection
Members
Member name | Value | Description
Rigid | 0 |  Rigid support
Free | 1 |  Free support (no support defined)
Flexible | 2 |  Flexible support (Flexible Stiffness is present)
RigidPressOnly | 3 |  Nonlinear press only
FlexiblePressOnly | 4 |  Nonlinear flexible press only
See Also
Reference
IdeaRS.OpenModel.Model Namespace